tutorials/rheoFoam/OtherTests/Channel3D_VE/Oldroyd-BLog/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
	type            poiseuilleVelocity;
	geometryType    Duct3D;
	uMean           1.;
	dirA            (0 1 0);
	dirB            (0 0 1);
	wA              1.;
	wB              1.;
	center          (0 0 0);
	
	value           uniform (0 0 0);
    }
    
    walls
    {
	type            fixedValue;
	value           uniform (0 0 0);    
    }

    outlet
    {
	type            zeroGradient;       
    }
}

// ************************************************************************* //
